number = 'Поделиться контактом'

run = '🏃 Бег'
velo = '🚴 Велогонка'
swim = '🏊 Плавание'

start = '🚩СТАРТ 🚩'

terms_swim = '🚩ПРАВИЛА ЭТАПА ПЛАВАНИЕ 🚩'

start_swim = '🚩СТАРТ: ПЛАВАНИЕ 🚩'

found = '👍 Я НАШЁЛ QR-КОД 👍'

swim_next = '🚩ПОПЛЫЛИ 🚩'

transit = '🏁 Я В ТРАНЗИТКЕ 🏁'

terms_velo = '🚩ПРАВИЛА ЭТАПА ВЕЛОГОНКА 🚩'

start_velo = '🚩СТАРТ: ВЕЛОГОНКА 🚩'

end_velo = '🏁 ЗАВЕРШИТЬ ВЕЛОГОНКУ 🏁'

zero_km = '⚡Я НА НУЛЕВОМ КИЛОМЕТРЕ ⚡'

make_velo = '🚴 СОБРАТЬ ВЕЛОСИПЕД 🚴'

terms_run = '🚩ПРАВИЛА ЭТАПА БЕГ 🚩'

start_run = '🚩СТАРТ: БЕГ 🚩'

came = '⚡Я НА МЕСТЕ ⚡'
need_hint = 'НУЖНА ПОДСКАЗКА'

go_next = '🚩ПОГНАЛИ ДАЛЬШЕ 🚩'

finish = '🚩ФИНИШ 🚩'

get_present = "🎁 ПОЛУЧИТЬ ПОДАРОК 🎁"

y = 'КОНЕЧНО, ПОМНЮ'
n = 'ЛУЧШЕ НАПОМНИ'

end_early = '🏁 НА ФИНИШ 🏁'
continue_quest = '🚴‍♂️ НА ВЕЛОСИПЕД 🚴‍♂️'

see_ammo = "🚩СМОТРЕТЬ ЭКИПИРОВКУ 🚩"

drive_next = '🚴 ЕДЕМ ДАЛЬШЕ 🚴'

place = "Я НА МЕСТЕ"

geo = '📍 ПОДЕЛИТЬСЯ ГЕОЛОКАЦИЕЙ 📍'