your_lang = 'Это твой язык'

help = 'Если вам нужна помощь или подсказка, пишите ➡️ @lenkkey'

wrong_ans = ["""Похоже, твои мысли сейчас куда-то спешат и путаются! Давай спокойно подумаем ещё раз.""",
             """Этот ответ неверный. Но даже олимпийские чемпионы когда-то путали термины. Главное — ты в игре, как настоящий триатлет!""",
             """Ой-ой, кажется, ты уплыл не в ту сторону! Давай попробуем ещё разок 🏊""",
             """Горячо! Ты как велосипедист на спуске — мчишься в нужном направлении, но чуть-чуть не туда свернул!""",]

wrong_btn_input = "Используй кнопку для ввода."

correct = 'Верно 👍 '

t1 = """Привет! 👋
Меня зовут Макс, и я буду твоим виртуальным помощником в Триатлон-квесте!  
"""
t2 = """Как тебя зовут? Напиши имя, чтобы я знал, кого буду мотивировать 😁
"""
t3 = """Так, и давай на всякий случай обменяемся контактами!
Оставь свой номер телефона. Обещаю не спамить мемами (ну, может, парочку 😅).

Не нужно писать цифры, просто нажми на кнопку внизу экрана ⤵️
"""
t3_1 = """Оставь номер телефона — пришлю важные уведомления о старте! (Только для квеста, не для спама 📵) Не нужно писать цифры, просто нажми на кнопку внизу экрана ⤵️
""" 

t3_2 = """И зафиксируем геолокацию! 📍 Напиши свой город — будем знать, где живут наши лучшие игроки! 🗺️"""


t3_3 = """Всё готово! ✅ 
Данные собраны, контакты на месте - теперь ты официально зарегистрирован в триатлон-квесте! ⚡️
Запоминай: стартуешь в любой день со 2 по 5 октября, но финишируешь не позднее 17:00 в воскресенье 5 октября 2025. 
Я пришлю напоминалку перед стартом. Будь на связи! 💪🔥"""

t4 = """А теперь - твой <b>email</b> 📩.

Пригодится для важных уведомлений (и, возможно, для секретного триатлон-этапа в будущем...).
Пиши точно, как в космос, — а то письмо улетит не туда! """
email_wrong = """Хм... Кажется, здесь затесался лишний котик 🐱 Проверь, чтобы было так: example@mail.ru. """
t5 = """Всё готово! 🎉 Данные собраны, контакты на месте — теперь ты официально зарегистрирован в триатлон-квесте!  Сейчас будет мини-разминка 💪
"""
t5_2 = """Всё готово! ✅ 
Данные собраны, контакты на месте - теперь ты официально зарегистрирован в триатлон-квесте! ⚡️
Запоминай: стартуешь в любой день со 2 по 5 октября, но финишируешь не позднее 17:00 в воскресенье 5 октября 2025. 
Я пришлю напоминалку перед стартом. Будь на связи! 💪🔥"""
t6 = """Я обожаю триатлон за бешеный микс! Ты сначала мчишься на велосипеде, потом плывёшь, как торпеда, а в конце бежишь к финишу без передышки— три вида спорта в одной гонке! Сложно? - Да! Но кайфово! 🤩
"""
t7 = """А давай проверим, сможешь ли ты стать триатлетом? Сейчас будет мини-разминка!
"""
t8 = """Триатлон — это три этапа подряд. Но я их нарочно перепутал, а ты попробуй расставить их в правильном порядке. Нажимай на кнопки внизу экрана и выбери правильную последовательность ⤵️"""
t9 = """
‼️ КАК ИСПОЛЬЗОВАТЬ КНОПКИ:
▪️При нажатии на верную кнопку появляется ✅
▪️Если ошибся, всё сбрасывается. 
▪️Количество попыток не ограничено.
"""
t10 = """Верно! Сначала вода, потом асфальт, и наконец — финиш на своих двоих! 💪

В Триатлон-квесте мы вместе пройдём три этапа, как настоящие спортсмены. Только вместо воды, велосипеда и беговой трассы у нас будут загадки и городские локации. 
Если что — я всегда подскажу и поддержу. Не зря же я здесь! 😉

Жми на кнопку внизу экрана, чтобы начать квест ⤵️
"""
t11 = """В Триатлон-квесте мы вместе пройдём три этапа, как настоящие спортсмены. Только вместо воды, велосипеда и беговой трассы у нас будут загадки и городские локации. Если что — я всегда подскажу и поддержу. Не зря же я здесь! 😉
"""
t12 = """Ты готов проверить свою смекалку и выносливость? Тогда вперёд — первый этап уже ждёт! """
t13 = """Жми на кнопку внизу экрана, чтобы начать квест ⤵️"""
t13_1 = '🏊 <b>ЭТАП 1: ПЛАВАНИЕ</b> 🏊'
t14 = """Погружаемся в первый этап — плавание! 🌊 
А ты знаешь, что без правильной экипировки далеко не уплывёшь? Давай соберем для тебя 5 предметов.

Но чтобы их получить, нужно выполнить 5 заданий. Каждое задание скрыто за QR-кодом. Я буду тебе подсказывать, где их искать.

Жми на кнопку внизу экрана ⤵️
"""

# t16 = """Готов к первому заплыву? Тогда ныряем. Жми на кнопку внизу экрана ⤵️
# """
t17 = """‼️ <b>ПРАВИЛА ЭТАПА ПЛАВАНИЕ</b>:
🚩 Находишь QR-код (я даю подсказку) 
🚩 Сканируешь его → открываешь задание.
🚩 Выполняешь задание → пишешь ответ в бот. 
🚩 Ответил правильно → получаешь один предмет экипировки.
🚩 Собрал все 5? → Этап завершён! 👏 

Всё понятно? Жми на кнопку внизу экрана, и поплыли искать первый QR-код ⤵️
"""
# t18 = """Всё понятно? Жми на кнопку внизу экрана, и поплыли искать первый QR-код ⤵️"""
t19 = """Наша дистанция начинается в Имеретинском морском порту! 🚢
Твой первый ориентир — бело-красный маяк на холме. Держи на него курс!"""

t19_caption = """Рядом с велопешеходной дорожкой ищи фонарный столб с цифрой 6 — на нём закреплен первый QR-код с заданием.  

‼️ Когда найдёшь — жми на кнопку внизу экрана ⤵️"""

t20 = """Когда найдёшь — жми на кнопку внизу экрана ⤵️"""
t21 = """Отлично! QR-код пойман — задание активировано! 🔥
Выполни задание и напиши ответ. Ответ - это одно слово ‼️
"""
t22 = """Точно, <b>ОЛИМПИЙКА</b>!🏊
Это не та куртка, которую забывают в спортзале, а короткая олимпийская дистанция в триатлоне: 1.5 км плавания, 40 км вело и 10 км бега."""
t23 = """
Держи свой первый трофей — спортивные часы, которые не боятся воды! ⌚️ Теперь ты будешь отслеживать время, как настоящий профи.
"""
t24 = """Плывём дальше искать следующий QR-код? Жми на кнопку внизу экрана ⤵️
"""
t25 = """Следующая цель — «Святая Виктория»! Эта уникальная бригантина построена по технологиям XIV века, — таких во всём мире осталось всего 16! Кстати, подобные яхты можно увидеть в «Пиратах Карибского моря», правда, именно эта в съёмках не участвовала. А жаль 😢 

QR-код ждёт тебя на ограждении яхты — на борт подниматься не нужно! 

‼️Нашёл код? Скорее жми кнопку внизу экрана ⤵️
"""
t26 = """Нашёл код? Скорее жми кнопку внизу экрана ⤵️"""
t27 = """Отлично! QR-код пойман — задание активировано! 🔥
Выполни задание и напиши ответ. Ответ - это одно слово ‼️
"""
t28 = """Угадал! Это <b>ДРАФТИНГ</b>!🌬️
Хитрый приём, когда ты держишься за лидером, будто тень, — и летишь вперёд, тратя меньше сил. Как умная рыбка за акулой, только без риска быть съеденным! 😉"""
t29 = """Получи гидрокостюм. Мы, триатлеты, называем его коротко - гидрик. 😎
В гидрике ты защищён от холода лучше, чем пингвин в Антарктиде! 🔥
"""
t30 = """Плывём дальше искать следующий QR-код? Жми на кнопку внизу экрана ⤵️
"""
t31 = """Отлично, спортсмен! Перед тобой открывается главная водная арена — Чёрное море! ⚓ Именно отсюда стартуют морские прогулки.

Твоя следующая навигационная задача - найти причал №2! Здесь их называют линиями. Всего их здесь пять, так что не сбейся со счёта! 😉 QR-код ждёт тебя прямо на ограждении.

‼️ Когда найдёшь — жми кнопку внизу экрана ⤵️
"""
t32 = """Когда найдёшь — жми кнопку внизу экрана ⤵️"""
t33 = """Отлично! QR-код пойман — задание активировано! 🔥
Выполни задание и напиши ответ. Ответ - это одно слово ‼️
"""
t34 = """Да это же <b>ЛЕЖАК</b>! 🚴‍♂️
Нет, это не про диван после работы — это аэродинамическая посадка на велосипеде. Чем ниже висишь, тем быстрее летишь. Главное — не уснуть в процессе!
"""
t35 = """Держи очки для плавания 🥽 Они защитят глаза от брызг и солнца и помогут держать курс в открытой воде. Ни бликов, ни потери обзора — только скорость и новые рекорды 💪"""
t36 = """Плывём дальше искать следующий QR-код? Жми на кнопку внизу экрана ⤵️"""
t37 = """Следующий QR-код спрятан на одном из арт-объектов на набережной — это такие стильные фиолетовые и зеленые кубы с местами для отдыха. 🌴 

Твоя задача — провести быструю разведку и найти нужный куб! Помни: настоящий спортсмен умеет концентрироваться на цели даже среди ярких объектов.

‼️Когда найдёшь QR-код, — жми кнопку внизу экрана ⤵️
"""
# t377 = """Почему? Да потому что наш город вырос из слияния десятков деревень, но при этом стал настоящим мегаполисом — вот такой парадокс! """
t38 = """Отлично! QR-код пойман — задание активировано! 🔥
Выполни задание и напиши ответ. Ответ - это одно слово ‼️
"""
t39 = """Бинго! <b>ФИНИШЁР</b> 🏆 
Это не просто тот, кто дошёл до конца. Это герой, который не свернул на последнем км к ларьку с мороженым. Ты тоже им станешь!
"""
t40 = """Ты получаешь буй для плавания 🌊  Это обязательный атрибут безопасности на открытой воде! С ним ты будешь заметен для судей и других спортсменов, даже если плывёшь на максимальной скорости 🚀"""
t41 = """Плывём дальше искать следующий QR-код? Жми на кнопку внизу экрана ⤵️
"""
t42 = """А теперь держи курс по набережной в сторону Олимпийского парка! 🔥

Как только увидишь начало бетонного забора — ищи проход налево на Парусную улицу. Там тебя ждут легендарные олимпийские кольца и следующий QR-код! 

Для точной наводки лови координаты: ⚡️43.408085, 39.941068 ⚡️. Но настоящий спортсмен найдёт цель и по ориентирам! 🎯

‼️Когда найдёшь QR-код, — жми кнопку внизу экрана ⤵️
"""

t43 = """Ты уже понял, что это памятник студентам XX-XXI веков? В XX веке в Тюмени появились два легендарных института — Тюменский индустриальный институт и Тюменский инженерно-строительный институт, которые позже объединились в большой Тюменский индустриальный университет (в 2016-м). Представляешь, сколько поколений инженеров здесь выучилось?
А если пройти дальше — увидишь студентов XIX века. Тогда в Тюмени вместо университетов было реальное училище— всё серьёзно: чернильницы, перья и никаких ноутбуков! Как они вообще формулы выводили без калькуляторов?  
"""
t44 = """Выполни задание и напиши ответ. Ответ - это одно слово ‼️"""
t45 = """Верно, это <b>ТРАНЗИТКА</b>! 🏁
Это ключевое место в триатлоне, где спортсмены переходят от одного этапа гонки к другому. Не просто «переодевалка» — это святая святых триатлета! Здесь ты меняешь гидрокостюм на велоформу так быстро, будто от этого зависит твоя жизнь. Спойлер: иногда так и есть 😅
"""
t46 = """Финальный штрих — шапочка. Теперь ты выглядишь как настоящий пловец! Главное — не забыть, что это для плавания, а не для моды! 😉
"""
t47 = """Ты отлично справился с водой и собрал полный комплект: часы, гидрокостюм, очки, буй и шапочку. Теперь заглянем в транзитку. Помнишь же, что это?

"""
t48 = """Транзитка в нашем квесте находится на горе (в прямом смысле!). Беги туда и найди бронзового барда, который пел, что «лучше гор могут быть только...»😉 Когда будешь на месте, — жми на кнопку  ⤵️"""
t49 = """Отлично! Ты в транзитке. Теперь выбор за тобой: 

🏁 НА ФИНИШ 🏁 если хочешь завершить триатлон-квест.

🚴‍♂️ НА ВЕЛОСИПЕД 🚴‍♂️ — если готов перейти к этапу Велогонка и продолжить приключение 💨

Обе кнопки внизу экрана ⤵️
"""

t49_1 = """Ты — молодец! Даже один этап триатлона требует силы и упорства. Вода тебе покорилась, и ты можешь начинать готовиться к настоящему триатлону. Смотри, как круто он проходит! 🏊‍♂️🚴‍♂️🏃‍♂️"""

t49_2 = """А теперь беги за подарком на стойку регистрации квеста. 🎁Ищи её на ярмарке (ЭКСПО) IRONSTAR на парковке напротив отеля Mantera Resort&Congress. 
Вот координаты: ⚡️ 43.410334, 39.939202⚡️
Когда добежишь, жми на кнопку ⤵️
"""

t49_3 = """После плавания триатлеты пересаживаются на велосипед. 🚴  Для триатлона тебе понадобится быстрый, технологичный велосипед — вот как у этого профи! 👇
"""

t50 = """Но сначала его нужно собрать, а для этого получить все детали! Сейчас мы этим и займёмся 😁
Нажми на кнопку, чтобы узнать правила  ⤵️
"""
t51 = """🚴  <b>ЭТАП 2: ВЕЛОГОНКА</b> 🚴 

‼️ <b>ПРАВИЛА ЭТАПА</b>:
🚴 5 подсказок — каждая указывает на уникальное место. 
🚴 Найди это место и узнай номер дома. 
🚴 Напиши номер дома в бот. За правильный ответ - виртуальная деталь велосипеда в боте!  
🚴 Собери все 5 частей — и получишь готового «железного коня» для гонки!  
"""
t52 = """‼️ Совет:
Разгадывай граффити-загадки и строй свой идеальный маршрут по городу. И да, подсказки с координатами будут, если вдруг застрянешь! 👌
"""
t53 = """Готов начать? Жми на кнопку внизу экрана ⤵️
"""

t544 = """Оглядись! 👀 Здесь, на Парусной улице, поселились арт-объекты фестиваля «Новые формы» 2024. Уличные художники со всего мира превратили это место в галерею под открытым небом!
"""
t5444 = """Именно здесь ты получишь первую деталь велосипеда — руль. Без него далеко не уедешь! Найди мальчишек, которые играют в хоккей. Видишь этот застывший момент броска и азарт в их движениях? Этот щелчок клюшкой — как твой первый рывок на трассе: тут важны точность и уверенность. Найди дом с этой сценой и напиши его номер. Ответ - это число ⤵️"""
t54 = """🆘 Вот твой аварийный пакет с координатами. Это как запасная камера: она спасает, когда совсем "прокололся". 😉 Попробуй сначала догадаться сам — так интереснее! 
"""
t55 = """🗺️ Вот они, заветные цифры\\. ||Точнее, буквы: ДЕ\\.ЖВЁЗЯД, ЕЯ\\.ЕЯДГЁГ
Расшифруй их и \\- вперед\\! 💪: А\\=1, Б\\=2\\.\\., Я\\=0 👨🏻‍🎓||
"""

photo_need = "Присылай одно фото"
t56 = """🔍 Координаты ниже — но это как энергетический гель: бери на крайняк, когда силы на исходе! А пока — попробуй догадаться сам 💡
"""
t57 = """⚠️ Для тех, кто ищет и найдет: ||ДЁ\\.AГЗДAВ, ЕД\\.ДГЯЕГA
И тут сюрприз\\! 🎁 Координаты зашифрованы буквами \\(А\\=1, Б\\=2,\\.\\.Я\\=0\\)||

"""
t58 = """🏁 Можно взять подсказку... а можно доказать, что ты — настоящий исследователь города!
"""
t59 = """🗺️ Вот они, заветные цифры\\. ||Точнее, буквы: ДЕ\\.ЖВЗAЁД, ЕЯ\\.ЕЯЖВЕЗ
GPS тут не поможет — только твоя смекалка\\! 🔠 В буквенных координатах А\\=1, Б\\=2\\.\\., Я\\=0||

"""
t60 = """🔍 Координаты есть... но настоящие следопыты обходятся без них! Сможешь разгадать сам? """
t61 = """🗺️ Лови координаты: ||ДЕ\\.ЖВЗЯЗЖ, ЕЯ\\.ЕЯЕЯЖЁ\\. Опять буквы вместо цифр\\. Но ты уже знаешь, что с ними делать 😁||"""
t62 = """🧠 Подсказка — как тренировочные колёса: выручает, но где драйв?"""
t63 = """⚡ Искомые координаты места:  ||ДЕ\\.ЖВЁББЗ, ЕЯ\\.ДЗЁЕВЯ
Разгадаешь? А\\=1, Б\\=2\\.\\., Я\\=0||

"""
t64 = """Нашел все точки, сделал крутые селфи? Тогда жми на кнопку внизу и давай заканчивать этот этап с треском! Не задерживайся — впереди ещё куча драйва! 💪😎"""
t65 = """<b><i>Админы уже проверяют твой крутой кадр!</i></b> 📸 
А твоя цель — разорванные цепи пролетариата! Да-да, ты не ослышался 😄 Беги туда, где история замерла в ожидании твоего рывка! 

Координаты простые — не промахнёшься: 
<b>⚡ 56.837935, 60.601975 ⚡</b>
Как будешь на месте, жми кнопку  ⤵️
"""
t66 = """Координаты простые — не промахнёшься: ⚡ 57.149701, 65.540539 ⚡ Если ты правильно построил свой маршрут, то ты где-то рядом. Как будешь на месте, жми кнопку  ⤵️"""
t67 = """Ну что, чемпион, ты нашёл все 5 деталей — теперь время для главного!
 🛠️ Собираем их в один быстрый, как молния, велосипед для триатлона! Скорее жми на кнопку, и посмотрим, что получится! ⤵️
"""
t68 = """Готово! Теперь у тебя не просто велосипед — а реактивный снаряд для триатлона! 🚀 Только не разгоняйся до световой скорости — а то финишную ленту порвёшь! 😉 
"""
t69 = """Но чтобы добраться до финишной ленты, нужно преодолеть еще один этап - БЕГ! 🏃
Я буду болеть за тебя — представь, что я бегу рядом и кричу: «Давай, ещё чуть-чуть!»😄

Готов стартовать? Жми на кнопку ⤵️
"""

t70 = """Готов стартовать? Жми на кнопку ⤵️"""
t71 = """<b>‼️ ПРАВИЛА ЭТАПА:</b>
1️⃣ НАЙДИ локацию по фото 
2️⃣ СДЕЛАЙ идентичный кадр (тот же ракурс, та же поза) 
3️⃣ ОТПРАВЬ фото в бот → ПОЛУЧИ символ
4️⃣ СОБЕРИ 6 символов
5️⃣ ЗАСЕКАЙ ВРЕМЯ → пробуй установить личный рекорд!
Пока бежишь (или бодро идешь) — слушай мои голосовые. Там подсказки! 😉 

Готов к забегу? Первая точка уже ждёт тебя! 🚀🏃‍♂️ Жми на кнопку, чтобы запустить таймер ⤵️

"""
t72 = """Готов к забегу? Первая точка уже ждёт тебя! 🚀🏃‍♂️ Жми на кнопку, чтобы запустить таймер ⤵️
"""
t73 = """Когда будешь на месте, нажми <b>Я НА МЕСТЕ</b>. А если заблудишься, нажми <b>НУЖНА ПОДСКАЗКА</b>, и я скину координаты.
Обе кнопки внизу экрана ⤵️

"""
t74 = """Лови координаты этого места:
📍Подземный переход под проспектом Ленина ||56.838153, 60.604469|| 
"""

t75 = """🔎 Найдите на стене в переходе фамилию товарища, которому нужно срочно подойти. Напиши фамилию  ⤵️"""
t76 = """Лови координаты этого места: 
📍улица Горького, 4А"""
t77 = """🔎 Найди конвертер. Какой он? Ответ - это прилагательное на табличке. ⤵️
"""
t78 = """Готов двигаться дальше? Жми на кнопку ⤵️
"""
t79 = """Лови координаты этого места: 
📍улица Малышева, 51
"""
t80 = """🔎 Найди, кого пьянил свежий ветер. Ответ - это прилагательное ⤵️"""
t82 = """Готов двигаться дальше? Жми на кнопку ⤵️"""
t83 = """Лови координаты этого места: 
📍 проспект Ленина, 46А"""
t84 = """🔎 Найди трёх муз над центральным входом в театр. Сколько лет прошло с даты на гербе? Ответ - это число ⤵️"""
t85 = """Готов двигаться дальше? Жми на кнопку ⤵️
"""
t86 = """Лови координаты этого места:
📍<b>56.844412, 60.606578</b>
"""
t87 = """🔎 Найди княжескую чету в ладье. Напиши, что в правой руке у Петра? ⤵️
"""
t88 = """Поздравляю! Ты нашел все метки! Теперь собери слово из полученных букв и напиши его сюда для завершения этого этапа  ⤵️
"""
t89 = """Это был бы отличный термин... для каких-нибудь других соревнований. Но в триатлоне мы называем это иначе 😄"""
t90 = """В точку! Спринт— это когда триатлон превращается в адреналиновый экспресс! 🚀 
Короткая дистанция (750 м плавание / 20 км вело / 5 км бег), но на такой скорости, что твои ноги потом спрашивают: «Эй, а где вообще финиш?» 😅 
"""

t92 = """А сейчас твои ноги должны спрашивать: «А где мои кроссовки?» 👟👟
Отвечу: классные виртуальные кроссовки ждут тебя в Спортивном парке на набережной. Скорее беги туда. 🏃‍♂️
Вот координаты: ⚡️ 43.399926, 39.949264⚡️

Когда будешь на месте, жми на кнопку ⤵️
"""
t93 = """Ты максимально молодец! 🎉 Три этапа, куча заданий — и ты со всем справился и собрал свою идеальную экипировку! Готов посмотреть, что теперь в твоём арсенале? 
Жми на кнопку ⤵️"""
t94 = """С таким снаряжением ты  — просто звезда триатлон-квеста!"""
t95 = """Сезон триатлона завершён, но новый старт уже совсем скоро — первый IRONSTAR в Египте ждёт тебя в 2026 году! 🏊‍♂️🚴‍♂️🏃‍♂️ 
Готовься к рекордам под жарким солнцем! 👉 https://t.me/ironstar_official/8242 

"""
t96 = """А теперь беги за подарком на стойку регистрации квеста. 🎁Ищи её на ярмарке (ЭКСПО) IRONSTAR на парковке напротив отеля Mantera Resort&Congress. 
Вот координаты: ⚡️ 43.410334, 39.939202⚡️
Когда добежишь, жми на кнопку ⤵️
"""
t97 = """Забирай подарок, ты его заслужил! Тебе понравилось наше триатлон-приключение?
Напиши пару строк о квесте — нам важно твоё мнение! 💙  Твой отзыв — как GPS для будущих квестов: поможет проложить идеальный маршрут 😉
"""
t98 = """Ну всё, давай прощаться! Пора накатывать круги в других приключениях! 🚴‍♂️
Пусть ветер всегда будет попутным, кроссовки — быстрыми, а велосипед — без проколов! До новых стартов! 👋"""


def generate_run_reult(time_seconds):
    return f'Твой результат на этапе БЕГ: {int(time_seconds) // 60} минут {int(time_seconds) % 60} секунд '


wr = """"""

t100 = "Отлично! Для перехода в транзитку просто нажми на кнопку  ⤵️"
t101 = "Транзитка в триатлоне — это как «пересменка» между этапами, где ты превращаешься из пловца в велосипедиста, а потом — в бегуна! 🏊‍♂️→🚴‍♂️→🏃‍♂️  "
t102 = """Транзитка в триатлоне — это как «пересменка» между этапами, где ты превращаешься из пловца в велосипедиста, а потом — в бегуна! 🏊‍♂️→🚴‍♂️→🏃‍♂️  

Здесь нужно:  
✔️Быстро переодеться/сменить экипировку  
✔️Чётко разместить велосипед в своей зоне  
✔️Не забыть шлем (иначе дисквалификация!)  

P.S. В нашем квесте транзитка — это просто точка перед новым этапом. 😎

Для перехода в транзитку просто нажми на кнопку  ⤵️
"""
# t103 = """P.S. В нашем квесте транзитка — это просто точка перед новым этапом, но представь, что ты на настоящем триатлоне! 😎

# Для перехода в транзитку просто нажми на кнопку  ⤵️
# """

t104 ="""Админы уже проверяют твой крутой кадр! 📸 
Когда фото пройдёт проверку, ты получишь деталь велосипеда 🚴‍♂️ А пока держи следующую граффити-загадку!
"""
t105 = """Фото улетело на проверку. Когда фото пройдёт проверку, ты получишь деталь велосипеда 🚴‍♂️
А сейчас ты можешь разгадывать следующую граффити-загадку! 
"""
# t106 = """Когда фото пройдёт проверку, ты получишь деталь велосипеда 🚴‍♂️"""

t107 ="""А теперь найди *ЮУНВИСРЕВЕР ЮУВОРАП УНИШАМ*\\. Какой век указан на её табличке? Ответ \\- это число\\. ⤵️

‼️Подсказка: ||Если не можешь это прочитать, попробуй прочитать наоборот||\\.
"""

after_end = """Ты прошёл весь триатлон-квест. Жду тебя на новых стартах! 
👉 https://iron-star.com"""

wrong_run = "Неправильно! ❌ Но ты близок к разгадке. Давай ещё попытку!"

t110  = """Сейчас будет мини-разминка 💪 

Триатлон — это три этапа подряд. Но я их нарочно перепутал, а ты попробуй расставить их в правильном порядке. Нажимай на кнопки внизу экрана и выбери правильную последовательность ⤵️
"""

tvelo2 = """Погнали! Ищи стену, где “Мисс Марс” под красным зонтом замерла рядом с космонавтом — будто два мира столкнулись на скорости. Идеальное напоминание, что даже в движении важно держать баланс. ⚖️ Кстати, “Мисс Марс” - это название этого мурала.
Вбивай номер дома и получишь деталь, которая скрепляет все детали велосипеда. Ответ - это число ⤵️
"""

tvelo3 = """Вперёд к новому муралу! Ищи на стене того, кто стал символом олимпийской мощи — снежного 🐆. Этот грациозный хищник знает всё о выносливости и силе, ведь он покоряет самые неприступные склоны. Именно здесь тебя ждёт деталь, которая отвечает за резкость и набор темпа. 🚀 Будь быстрее 🐆- скорее пиши номер этого дома! Ответ - это число ⤵️"""
tvelo4 ="""Поехали за седлом! Ищи дом, где на стене оживают символы древних китайских легенд: дракон, олицетворяющий неукротимый дух, и лошадь, чей галоп символизирует бесстрашие. Их союз — как идеальная связь гонщика и велосипеда: мощь под контролем, скорость с достоинством. Впиши номер дома — и вперёд! Ответ - это число ⤵️
"""
tvelo5 ="""Финальный рывок! В конце улицы тебя ждёт самый масштабный мурал: гигантское абстрактное полотно, на котором бушует море алых, желтых и ультрамариновых мазков, сливающихся в динамичный вихрь. 💨
Присмотрись — это не просто хаос, а момент, когда спортсменка прорывается через финишную ленту. 🏁
Именно здесь ты получишь последнюю деталь велосипеда. Пиши номер этого дома - пора начинать сборку! Ответ - это число ⤵️
"""

dop_rule = """🏃‍♂️<b>ЭТАП 3: БЕГ</b>🏃‍♂️

🏆 Впереди Олимпийский парк — легендарное место с уникальной атмосферой! Здесь можно почувствовать дух великих спортивных побед и сделать потрясающие фото на память.
"""

caption_run = """‼️ Найди место на фото, повтори кадр (тот же ракурс, та же поза), скинь фото в бот. Слушай голосовое с подсказкой ⤵️"""

run_answers = ["Фото получено! 👌Лови символ, как и обещал.",
               "Отлично, фото зафиксировано. Вот тебе символ.",
               "Супер, кадр в копилке! 👍Держи символ.",
               "О, интересное фото получилось. 👏Продолжаем квест. ",
               "Очень нестандартный кадр! 😁 Держи символ и бежим дальше. ",
               "Я оценил твой креативный подход. 🔥Получи символ.",]

need_photo = "Задача простая: сделай фото и скинь его сюда."

ask_geo = """Отлично! Чтобы я убедился, что ты в нужной точке, жми кнопку ⤵️
Не переживай — данные только для квеста. Как отправишь, скажу, что делать дальше! 💪"
"""

caption_kross = """Сначала лови классные кроссовки за прохождение этапа БЕГ!  Теперь жми на кнопку 🚩ФИНИШ 🚩 — так мы остановим твой чемпионский таймер и зафиксируем твой результат! ⏱️"""

wrong_geo = ["Вижу, ты активно исследуешь окрестности, но кроссовки ждут тебя в другом месте! 😁",
"Боюсь, что твои координаты не совпадают с нужной точкой. Подойди поближе.",
"Похоже, ты сейчас далековато от точки. ",]